acclmcopy-cfe-consolidation/ExchangePlans/Консолидация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>Консолидация</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИспользованияОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьРегистрацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

acclmcopy-cfe-consolidation/ExchangePlans/Консолидация/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет настройки, влияющие на использование плана обмена.
//
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт

	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена 		= Ложь;
	Настройки.Алгоритмы.ПриПолученииВариантовНастроекОбмена 		= Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки 		= Истина;
	Настройки.Алгоритмы.ОбработчикПроверкиПараметровУчета 			= Ложь;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку 				= Ложь;
	Настройки.Алгоритмы.ПриСохраненииНастроекСинхронизацииДанных 	= Ложь;

	Настройки.ИмяКонфигурацииИсточника = "БухгалтерияПредприятияКОРП";
	Настройки.ИмяКонфигурацииПриемника.Вставить("УправлениеХолдингом");
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Ложь;

КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
//
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт

	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена Консолидации БП - УХ'");
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;

	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ОбменДаннымиСервер.ВсеТранспортыСообщенийОбменаКонфигурации();

	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("ru='Обмен с Консолидацией'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "";
	ОписаниеВарианта.ОбщиеДанныеУзлов =
		"ИспользоватьОтборПоОрганизациям, Организации, РегистрироватьИзменения, ДатаНачалаИспользованияОбмена, ВыполнятьРегистрацию";

	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "УправлениеХолдингом";
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru='УХ'");

	ЗаголовокКоманды   = НСтр("ru='Консолидация БП - УХ'");
	ЗаголовокПомощника = НСтр("ru='Синхронизация с УХ (настройка)'");
	ЗаголовокУзла      = НСтр("ru='Синхронизация с УХ'");

	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = ЗаголовокКоманды;
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена               = ЗаголовокПомощника;
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена                       = ЗаголовокУзла;

	// Пустое значение: правила отправки/получения настраиваются через ФормаУзла.
	ОписаниеВарианта.ИмяФормыПомощникаНастройкиСинхронизацииДанных = "";

КонецПроцедуры

Процедура ПриПолученииВариантовНастроекОбмена(ВариантыНастроекОбмена, ПараметрыКонтекста) Экспорт
	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки = "КонсолидацияБПУХ";
	ВариантНастройки.КорреспондентВМоделиСервиса = Ложь;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;
КонецПроцедуры

// Регистрирует изменения объектов для узлов плана обмена Консолидация
//
// Параметры:
//  Узел - ПланОбменаСсылка.Консолидация - узел плана обмена
//  Объект - ЛюбаяСсылка - регистрируемый объект
//
Процедура ЗарегистрироватьИзмененияОбъекта(Узел, Объект) Экспорт

	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;

	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Объект);

КонецПроцедуры

// Проверяет, нужно ли регистрировать изменения документа
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проверяемый документ
//
// Возвращаемое значение:
//  Булево - Истина, если документ имеет движения по регистру Хозрасчетный
//
Функция ДокументИмеетДвиженияХозрасчетный(ДокументОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Регистратор";

	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

// Регистрирует изменения для всех узлов плана обмена
//
// Параметры:
//  Объект - ЛюбаяСсылка - регистрируемый объект
//
Процедура ЗарегистрироватьИзмененияДляВсехУзлов(Объект) Экспорт

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Консолидация.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.Консолидация КАК Консолидация
	|ГДЕ
	|	НЕ Консолидация.ЭтотУзел";

	ВыборкаУзлов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаУзлов.Следующий() Цикл
		ЗарегистрироватьИзмененияОбъекта(ВыборкаУзлов.Ссылка, Объект);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
